<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"a391024442965faf6654020d44a000e456c384293a2818b7bf29b8136a063907","plan_job_ref":"Job Orchestrator #5 at https://github.com/coverage-robot/core/actions/runs/6758005496","plan_hash":"7bb40ca2be960ca0cc67a1b01fca2dbeb7fcf211c9b6f2ec224b7061a8b1cc89","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __./services/orchestrator/infrastructure__ in the __prod__ workspace
With var files: `./services/orchestrator/infrastructure/prod.tfvars`
<details>
<summary>Plan: 8 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.event_store.aws_dynamodb_table.event_table will be created
  + resource "aws_dynamodb_table" "event_table" {
      + arn                         = (known after apply)
      + billing_mode                = "PROVISIONED"
      + deletion_protection_enabled = true
      + hash_key                    = "**********"
      + id                          = (known after apply)
      + name                        = "coverage-orchestrator-event-store-prod"
      + range_key                   = "*******"
      + read_capacity               = 5
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags_all                    = (known after apply)
      + write_capacity              = 5

      + attribute {
          + name = "identifier"
          + type = "S"
        }
      + attribute {
          + name = "version"
          + type = "N"
        }

      + ttl {
          + attribute_name = "expiry"
          + enabled        = true
        }
    }

  # module.orchestrator.aws_cloudwatch_event_rule.service will be created
  + resource "aws_cloudwatch_event_rule" "service" {
      + arn            = (known after apply)
      + event_bus_name = "coverage-events-prod"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "INGEST_SUCCESS",
                  + "INGEST_FAILURE",
                  + "JOB_STATE_CHANGE",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "coverage-orchestrator-prod"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.orchestrator.aws_iam_policy.orchestrator_policy will be created
  + resource "aws_iam_policy" "orchestrator_policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "orchestrator-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "events:PutEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:events:eu-west-2:952005856579:event-bus/coverage-events-prod",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.orchestrator.aws_iam_role.orchestrator_role will be created
  + resource "aws_iam_role" "orchestrator_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "orchestrator-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.orchestrator.aws_iam_role_policy_attachment.attach_lamdba_logging_policy will be created
  + resource "aws_iam_role_policy_attachment" "attach_lamdba_logging_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "orchestrator-role"
    }

  # module.orchestrator.aws_lambda_function.service will be created
  + resource "aws_lambda_function" "service" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + filename                       = "orchestrator/../deployment.zip"
      + function_name                  = "coverage-orchestrator-prod"
      + handler                        = "App\\Handler\\EventHandler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:eu-west-2:534081306603:layer:arm-php-82:38",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "provided.al2"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "vXhi+CL3MJQtprm/0QIs/un7WiAAw6N2F2JlebC4o9E="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "EVENT_BUS" = "coverage-events-prod"
            }
        }
    }

  # module.orchestrator.aws_lambda_function_event_invoke_config.service_invoke_config will be created
  + resource "aws_lambda_function_event_invoke_config" "service_invoke_config" {
      + function_name          = "coverage-orchestrator-prod"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.orchestrator.aws_lambda_permission.lambda_permissions will be created
  + resource "aws_lambda_permission" "lambda_permissions" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "coverage-orchestrator-prod"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Orchestrator #5](https://github.com/coverage-robot/core/actions/runs/6758005496)